//**************************************************************************
//*                     This file is part of the                           *
//*                      Mpxplay - audio player.                           *
//*                  The source code of Mpxplay is                         *
//*        (C) copyright 1998-2010 by PDSoft (Attila Padar)                *
//*                http://mpxplay.sourceforge.net                          *
//*                  email: mpxplay@freemail.hu                            *
//**************************************************************************
//*  This program is distributed in the hope that it will be useful,       *
//*  but WITHOUT ANY WARRANTY; without even the implied warranty of        *
//*  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.                  *
//*  Please contact with the author (with me) if you want to use           *
//*  or modify this source.                                                *
//**************************************************************************
//function: ALAC decoder

#include "in_file.h"

#ifdef MPXPLAY_LINK_DECODER_ALAC

#include "newfunc\newfunc.h"

typedef signed char         int8_t;
typedef signed short        int16_t;
typedef signed int          int32_t;
typedef signed __int64      int64_t;
typedef unsigned char       uint8_t;
typedef unsigned short      uint16_t;
typedef unsigned int        uint32_t;
typedef unsigned __int64    uint64_t;

typedef struct alac_file
{
 mpxplay_bitstreambuf_s bs;

 int samplesize;
 int numchannels;
 int bytespersample;

 int32_t *predicterror_buffer_a; // buffers
 int32_t *predicterror_buffer_b;
 int32_t *outputsamples_buffer_a;
 int32_t *outputsamples_buffer_b;
 int32_t *uncompressed_bytes_buffer_a;
 int32_t *uncompressed_bytes_buffer_b;

 uint32_t setinfo_max_samples_per_frame; /* 0x1000 = 4096 */    /* max samples per frame? */
 uint8_t setinfo_7a; /* 0x00 */
 uint8_t setinfo_sample_size; /* 0x10 */
 uint8_t setinfo_rice_historymult; /* 0x28 */
 uint8_t setinfo_rice_initialhistory; /* 0x0a */
 uint8_t setinfo_rice_kmodifier; /* 0x0e */
 uint8_t setinfo_7f; /* 0x02 */
 uint16_t setinfo_80; /* 0x00ff */
 uint32_t setinfo_82; /* 0x000020e7 */ /* max sample size?? */
 uint32_t setinfo_86; /* 0x00069fe4 */ /* bit rate (avarge)?? */
 uint32_t setinfo_8a_rate; /* 0x0000ac44 */
}alac_file;

static alac_file *alac_decoder_open(int samplesize, int numchannels);
static void alac_decoder_close(alac_file *alac);
static unsigned int alac_set_info(alac_file *alac, char *inputbuffer);
static unsigned int alac_allocate_buffers(alac_file *alac);
static void alac_decode_frame(alac_file *alac,unsigned char *inbuffer,unsigned int inbufsize,void *outbuffer,int *outputsize);

static void AD_ALAC_close(struct mpxplay_audio_decoder_info_s *adi);

typedef struct alac_decoder_data_s{
 alac_file *alacf;
 char *extradata;
}alac_decoder_data_s;

static int AD_ALAC_open(struct mpxplay_audio_decoder_info_s *adi,struct mpxplay_streampacket_info_s *spi)
{
 struct alac_decoder_data_s *alaci;
 alac_file *alacf;

